In [1]:
import torch
from transformers import AutoModelForCausalLM, BitsAndBytesConfig, AutoTokenizer

base_model = "codellama/CodeLlama-7b-hf"
model = AutoModelForCausalLM.from_pretrained(
    base_model,
    load_in_8bit=True,
    torch_dtype=torch.float16,
    device_map="auto",
)
tokenizer = AutoTokenizer.from_pretrained("codellama/CodeLlama-7b-hf")

/home/gcpuser/miniconda3/lib/python3.9/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm
The model weights are not tied. Please use the `tie_weights` method before using the `infer_auto_device` function.
Loading checkpoint shards: 100%|██████████| 2/2 [00:06<00:00,  3.18s/it]

In [2]:
from peft import PeftModel
model = PeftModel.from_pretrained(model, "sql-code-llama/checkpoint-160")

In [3]:
def generate_prompt(data_point):
    full_prompt =f"""You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.

### Input:
{data_point["question"]}

### Context:
{data_point["context"]}

### Response:
"""
    return full_prompt

In [4]:
import json
with open('spider_create_context_val_db_id.json', 'r') as f:
    data = json.load(f)

# Step 2: Apply the function to each entry
# responses = map(your_function, data)
prompts = []
for data_point in data:
    prompt = generate_prompt(data_point)
    # append prompt to prompts
    prompts.append(prompt)

In [5]:
tokenizer.pad_token = tokenizer.eos_token

In [6]:
# single prompt inference test:
test_prompts = prompts[0:4]
# for prompt in test_prompts:
#     print("prompt is: ", prompt)
tokenized_inputs = tokenizer(test_prompts, return_tensors="pt", padding=True, truncation=True)
# decoded_inputs = #[tokenizer.decode(input, skip_special_tokens=True) for input in tokenized_inputs]
decoded_inputs = [tokenizer.decode(input_ids, skip_special_tokens=True) for input_ids in tokenized_inputs["input_ids"]]
for input in decoded_inputs:
    print(input)
test_prompts == decoded_inputs

Asking to truncate to max_length but no maximum length is provided and the model has no predefined maximum length. Default to no truncation.

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
How many singers do we have?

### Context:
CREATE TABLE singer (Id VARCHAR)

### Response:

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
Show name, country, age for all singers ordered by age from the oldest to the youngest.

### Context:
CREATE TABLE singer (name VARCHAR, country VARCHAR, age VARCHAR)

### Response:

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
What is the average, minimum, and maximum age of all singers from France?

### Context:
CREATE TABLE singer (age INTEGER, country VARCHAR)

### Response:

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
Show the name and the release year of the song by the youngest singer.

### Context:
CREATE TABLE singer (song_name VARCHAR, song_release_year VARCHAR, age VARCHAR)

### Response:

True

In [7]:
batch_outputs = model.generate(**tokenized_inputs, max_new_tokens=100)
# print(batch_outputs)
batch_decoded_outputs = [tokenizer.decode(output, skip_special_tokens=True) for output in batch_outputs]
print("decoded batch outputs:")
for output in batch_decoded_outputs:
    print(output)

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.
/home/gcpuser/miniconda3/lib/python3.9/site-packages/transformers/generation/utils.py:1535: UserWarning: You are calling .generate() with the `input_ids` being on a device type different than your model's device. `input_ids` is on cpu, whereas the model is on cuda. You may experience unexpected behaviors or slower generation. Please make sure that you have put `input_ids` to the correct device by calling for example input_ids = input_ids.to('cuda') before running `.generate()`.
  warnings.warn(

decoded batch outputs:
You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
How many singers do we have?

### Context:
CREATE TABLE singer (Id VARCHAR)

### Response:
SELECT COUNT(*) FROM singer

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
Show name, country, age for all singers ordered by age from the oldest to the youngest.

### Context:
CREATE TABLE singer (name VARCHAR, country VARCHAR, age VARCHAR)

### Response:
SELECT name, country, age FROM singer ORDER BY age DESC

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
What is the average, minimum, and maximum age of all singers from France?

### Context:
CREATE TABLE singer (age INTEGER, country VARCHAR)

### Response:
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.

### Input:
Show the name and the release year of the song by the youngest singer.

### Context:
CREATE TABLE singer (song_name VARCHAR, song_release_year VARCHAR, age VARCHAR)

### Response:
SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1

In [9]:
batch_size = 12  # You can adjust the batch size based on your GPU capacity
outputs = []

model.eval()
with torch.no_grad(), open('codellama7b-valoutputs2.txt', 'a') as f:
    for i in range(0, len(prompts), batch_size):
        print("i is: ", i)
        batch_inputs = prompts[i:i+batch_size]
        
        # Step 3: Loop over the batches and generate the outputs
        batch_model_inputs = tokenizer(batch_inputs, return_tensors="pt", padding=True, truncation=True)
        
        input_lengths = [len(input_ids) for input_ids in batch_model_inputs["input_ids"]]
        
        batch_outputs = model.generate(**batch_model_inputs, max_new_tokens=100)
        
        # Step 4: Collect the outputs
        batch_decoded_outputs = [tokenizer.decode(output[input_length:], skip_special_tokens=True) for output, input_length in zip(batch_outputs, input_lengths)]
        outputs.extend(batch_decoded_outputs)
        print(outputs)
        for b in batch_decoded_outputs:
            f.write(b.replace("\n", " ") + "\n")
        
# Now, `outputs` is a list containing the outputs for all 900 inputs

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

i is:  0

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n']
i is:  12

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n"]
i is:  24

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n']
i is:  36

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n']
i is:  48

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n']
i is:  60

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN"]
i is:  72

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n']
i is:  84

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2']
i is:  96

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n']
i is:  108

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n"]
i is:  120

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n"]
i is:  132

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n']
i is:  144

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n']
i is:  156

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n']
i is:  168

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n']
i is:  180

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

['SELECT COUNT(*) FROM singer\n', 'SELECT name, country, age FROM singer ORDER BY age DESC\n', "SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'\n", 'SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1\n', 'SELECT DISTINCT country FROM singer WHERE age > 20\n', 'SELECT country, COUNT(*) FROM singer GROUP BY country\n', 'SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)\n', 'SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000\n', 'SELECT MAX(average), AVG(capacity) FROM stadium\n', 'SELECT AVG(capacity), MAX(capacity) FROM stadium\n', 'SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1\n', 'SELECT COUNT(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015\n', 'SELECT T1.name, COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id GROUP BY T1.stadium_id\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year >= 2014 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name, T1.capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.year > 2013 GROUP BY T1.stadium_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert)\n', 'SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30\n', 'SELECT name FROM stadium WHERE NOT stadium_id IN (SELECT stadium_id FROM concert WHERE year = 2014)\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.concert_name, T1.theme, COUNT(*) FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_id = T2.concert_id GROUP BY T1.concert_name, T1.theme\n', 'SELECT T1.name, COUNT(*) FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id GROUP BY T1.name\n', 'SELECT T1.name FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.singer_id = T2.singer_id JOIN concert AS T3 ON T2.concert_id = T3.concert_id WHERE T3.year = 2014\n', "SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'\n", 'SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2014 INTERSECT SELECT T1.name, T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.stadium_id = T2.stadium_id WHERE T2.Year = 2015', 'SELECT COUNT(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id = T2.stadium_id ORDER BY T2.capacity DESC LIMIT 1\n', 'SELECT COUNT(*) FROM pets WHERE weight > 10\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT MAX(weight), petType FROM pets GROUP BY petType\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.age > 20\n', 'SELECT COUNT(*) FROM has_pet AS T1 JOIN pets AS T2 ON T1.petid = T2.petid JOIN student AS T3 ON T1.stuid = T3.stuid WHERE T2.pettype = "dog" AND T3.sex = "F"\n', 'SELECT COUNT(DISTINCT pettype) FROM pets\n', 'SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" OR T3.pettype = "dog"\n', 'SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat" INTERSECT SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON', "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = 'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON", 'SELECT T1.major, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "cat"\n', "SELECT T1.stuid FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid LEFT JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype <> 'cat'\n", 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pettype = "dog" EXCEPT SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.', 'SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1\n', 'SELECT petid, weight FROM pets WHERE pet_age > 1\n', 'SELECT AVG(pet_age), MAX(pet_age), pettype FROM pets GROUP BY pettype\n', 'SELECT AVG(weight), pettype FROM pets GROUP BY pettype\n', 'SELECT T1.fname, T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid\n', "SELECT T1.petid FROM has_pet AS T1 JOIN student AS T2 ON T1.stuid = T2.stuid WHERE T2.Lname = 'Smith'\n", 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT COUNT(*), T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T1.stuid\n', 'SELECT T1.fname, T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid GROUP BY T2.stuid HAVING COUNT(*) > 1\n', 'SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid = T2.stuid JOIN pets AS T3 ON T2.petid = T3.petid WHERE T3.pet_age = 3 AND T3.pettype = "cat"\n', 'SELECT AVG(T1.age) FROM student AS T1 LEFT JOIN has_pet AS T2 ON T1.stuid = T2.stuid WHERE T2.stuid IS NULL\n', 'SELECT COUNT(*) FROM CONTINENTS\n', 'SELECT T1.ContId, T1.Continent, COUNT(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId = T2.Continent GROUP BY T1.ContId\n', 'SELECT COUNT(*) FROM COUNTRIES\n', 'SELECT T1.FullName, T1.Id, COUNT(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.horsepower LIMIT 1\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Weight < (SELECT AVG(T3.Weight) FROM CARS_DATA AS T3)\n', 'SELECT T1.Maker FROM CAR_MAKERS AS T1 JOIN CARS_DATA AS T2 ON T1.Id = T2.id JOIN MODEL_LIST AS T3 ON T3.model = T2.model JOIN CAR_NAMES AS T4 ON T4.MakeId = T1.Id WHERE T2.year = 1970\n', 'SELECT T1.Make, T2.Year FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id ORDER BY T2.Year LIMIT 1\n', 'SELECT DISTINCT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.model = T2.model JOIN CARS_DATA AS T3 ON T1.MakeId = T3.id WHERE T3.year > 1980\n', 'SELECT COUNT(DISTINCT T1.CountryId), T2.Continent FROM car_makers AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN CONTINENTS AS T3 ON T2.ContId = T3.ContId GROUP BY T3.Continent\n', 'SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*), T2.fullname FROM car_makers AS T1 JOIN model_list AS T2 ON T1.id = T2.maker GROUP BY T2.fullname\n', 'SELECT COUNT(*), T1.Id, T1.FullName FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.FullName GROUP BY T1.Id\n', 'SELECT T1.Accelerate FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Make = "amc" AND T1.Model = "hornet" AND T1.Model = "sportabout" AND T1.Model = "sw"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId WHERE T2.CountryName = "France"\n', 'SELECT COUNT(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country = T2.CountryId JOIN MODEL_LIST AS T3 ON T3.Maker = T1.Id WHERE T2.CountryName = "USA"\n', 'SELECT AVG(mpg) FROM CARS_DATA WHERE Cylinders = 4\n', 'SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974\n', 'SELECT DISTINCT Maker, Model FROM MODEL_LIST\n', 'SELECT T1.CountryName, T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.Country = T2.Country\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE horsepower > 150\n', 'SELECT AVG(Weight), YEAR FROM CARS_DATA GROUP BY YEAR\n', "SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.CountryId = T2.ContId WHERE T2.Continent = 'Europe' INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country INTERSECT SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN", 'SELECT T1.Make, MAX(T2.horsepower) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.cylinders = 3 GROUP BY T1.Make\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id GROUP BY T1.Model ORDER BY MAX(T2.mpg) DESC LIMIT 1\n', 'SELECT T1.model FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id ORDER BY T2.mpg DESC LIMIT 1\n', 'SELECT AVG(horsepower) FROM CARS_DATA WHERE YEAR < 1980\n', 'SELECT AVG(horsepower) FROM cars_data WHERE year < 1980\n', 'SELECT AVG(T1.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T1.Model = "volvo"\n', 'SELECT MAX(Accelerate), Cylinders FROM CARS_DATA GROUP BY Cylinders\n', 'SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 4\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE YEAR = 1980\n', 'SELECT COUNT(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker = T2.Id WHERE T2.FullName = "American Motor Company"\n', 'SELECT T1.FullName, T2.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker GROUP BY T1.Id HAVING COUNT(*) > 3\n', 'SELECT DISTINCT T1.Model FROM CAR_NAMES AS T1 JOIN CAR_MAKERS AS T2 ON T1.MakeId = T2.Id JOIN CARS_DATA AS T3 ON T1.Model = T3.Id WHERE T2.FullName = "General Motors" OR T3.weight > 3500\n', 'SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000\n', 'SELECT horsepower FROM CARS_DATA ORDER BY accelerate DESC LIMIT 1\n', 'SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T2.Model = "volvo" ORDER BY T1.accelerate LIMIT 1\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate > (SELECT MAX(Accelerate) FROM CARS_DATA)\n', 'SELECT COUNT(*) FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country WHERE COUNT(*) > 2\n', 'SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders > 6\n', 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId = T2.Id WHERE T2.Cylinders = 4 ORDER BY T2.horsepower DESC LIMIT 1\n', 'SELECT T1.MakeId, T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id = T2.MakeId WHERE T1.Horsepower > (SELECT MIN(Horsepower) FROM CARS_DATA) AND T1.Cylinders NOT IN (SELECT T1.Cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T', 'SELECT T1.makeid, T1.make FROM car_names AS T1 JOIN cars_data AS T2 ON T1.makeid = T2.id WHERE T2.horsepower < 4 AND T2.cylinders < 4\n', 'SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980\n', 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2.Maker JOIN CARS_DATA AS T3 ON T2.Model = T3.Id WHERE T3.weight < 3500 EXCEPT SELECT T1.model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.MakeId = T2', 'SELECT T1.CountryName FROM countries AS T1 LEFT JOIN CAR_MAKERS AS T2 ON T1.countryId = T2.Country WHERE T2.Country IS NULL\n', 'SELECT T1.id, T1.maker FROM car_makers AS T1 JOIN model_list AS T2 ON T1.maker = T2.maker JOIN car_names AS T3 ON T2.model = T3.model GROUP BY T1.id HAVING COUNT(*) >= 2 AND COUNT(*) <= 3\n', 'SELECT T1.Id, T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Maker = T2.Maker JOIN CAR_NAMES AS T3 ON T2.model = T3.model GROUP BY T1.Id HAVING COUNT(*) >= 2 AND SUM(T3.model) >= 3\n', "SELECT T1.countryId, T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId = T2.Country JOIN MODEL_LIST AS T3 ON T2.Id = T3.Maker WHERE T3.Model = 'fiat' OR COUNT(*) > 3\n", 'SELECT T1.countryid, T1.countryname FROM countries AS T1 JOIN car_makers AS T2 ON T1.countryid = T2.country JOIN model_list AS T3 ON T2.id = T3.maker WHERE T3.model = "fiat" OR COUNT(*) > 3\n', 'SELECT Country FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Abbreviation FROM AIRLINES WHERE Airline = "JetBlue Airways"\n', 'SELECT Airline, Abbreviation FROM AIRLINES WHERE Country = "USA"\n', "SELECT AirportCode, AirportName FROM AIRPORTS WHERE city = 'Anthony'\n", 'SELECT COUNT(*) FROM airlines\n', 'SELECT COUNT(*) FROM AIRLINES\n', 'SELECT COUNT(*) FROM AIRPORTS\n', 'SELECT COUNT(*) FROM Flight\n', 'SELECT COUNT(*) FROM FLIGHTS\n', "SELECT Airline FROM AIRLINES WHERE Abbreviation = 'UAL'\n", 'SELECT COUNT(*) FROM AIRLINES WHERE Country = "USA"\n', "SELECT City, Country FROM AIRPORTS WHERE AirportName = 'Alton'\n", "SELECT AirportName FROM AIRPORTS WHERE AirportCode = 'AKO'\n", "SELECT AirportName FROM AIRPORTS WHERE City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE SourceAirport = 'APG'\n", "SELECT COUNT(*) FROM FLIGHTS WHERE DestAirport = 'ATO'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = 'Aberdeen'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport = T3.AirportCode WHERE T2.City = 'Aberdeen' AND T3.City = 'Ashley'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'JetBlue Airways'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.DestAirport = 'ASY'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = 'United Airlines' AND T1.SourceAirport = 'AHD'\n", "SELECT COUNT(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode JOIN AIRLINES AS T3 ON T1.Airline = T3.uid WHERE T3.Airline = 'United Airlines' AND T2.City = 'Aberdeen'\n", 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.SourceAirport GROUP BY T1.City ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode = T2.DestAirport GROUP BY T1.AirportCode ORDER BY COUNT(*) LIMIT 1\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.Abbreviation, T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid ORDER BY COUNT(*) LIMIT 1\n', "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.DestAirport = 'AHD'\n", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'APG' INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport =", "SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = 'CVO' EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline WHERE T2.SourceAirport = '", 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.uid HAVING COUNT(*) >= 10\n', 'SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid = T2.Airline GROUP BY T1.Airline HAVING COUNT(*) < 200\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline = T2.uid WHERE T2.Airline = "United Airlines"\n', 'SELECT FlightNo FROM FLIGHTS WHERE SourceAirport = "APG"\n', 'SELECT FlightNo FROM FLIGHTS WHERE DestAirport = "APG"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.City = "Aberdeen"\n', "SELECT COUNT(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport = T2.AirportCode WHERE T2.city = 'Aberdeen' OR T2.city = 'Abilene'\n", 'SELECT T1.AirportName FROM Airports AS T1 LEFT JOIN Flights AS T2 ON T1.AirportCode = T2.AirportCode WHERE T2.AirportCode IS NULL\n', 'SELECT COUNT(*) FROM Employee\n', 'SELECT COUNT(*) FROM employee\n', 'SELECT name FROM employee ORDER BY age\n', 'SELECT COUNT(*), city FROM employee GROUP BY city\n', 'SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1\n', 'SELECT LOCATION, COUNT(*) FROM shop GROUP BY LOCATION\n', 'SELECT manager_name, district FROM shop ORDER BY number_products DESC LIMIT 1\n', 'SELECT MIN(Number_products), MAX(Number_products) FROM shop\n', 'SELECT name, LOCATION, district FROM shop ORDER BY number_products DESC\n', 'SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID GROUP BY T2.Employee_ID ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE T2.bonus = (SELECT MAX(T3.bonus) FROM evaluation AS T3)\n', 'SELECT T1.name FROM employee AS T1 JOIN evaluation AS T2 ON T1.Employee_ID = T2.Employee_ID WHERE NOT T2.name IN (SELECT T3.name FROM employee AS T3 JOIN evaluation AS T4 ON T3.Employee_ID = T4.Employee_ID WHERE T4.name = T2.name)\n', 'SELECT T1.name FROM shop AS T1 JOIN hiring AS T2 ON T1.shop_id = T2.shop_id GROUP BY T2.shop_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT name FROM shop WHERE NOT shop_id IN (SELECT shop_id FROM hiring)\n', 'SELECT COUNT(*), T1.name FROM hiring AS T1 JOIN shop AS T2 ON T1.shop_id = T2.shop_id GROUP BY T1.shop_id\n', 'SELECT SUM(bonus) FROM evaluation\n', 'SELECT * FROM hiring\n', 'SELECT district FROM shop WHERE Number_products < 3000 INTERSECT SELECT district FROM shop WHERE Number_products > 10000\n', 'SELECT COUNT(DISTINCT LOCATION) FROM shop\n', 'SELECT COUNT(*) FROM Documents\n', 'SELECT document_id, document_name, document_description FROM Documents\n', "SELECT document_name, template_id FROM Documents WHERE Document_Description LIKE '%w%'\n", 'SELECT document_id, template_id, Document_Description FROM Documents WHERE document_name = "Robbin CV"\n', 'SELECT COUNT(DISTINCT template_id) FROM Documents\n', "SELECT COUNT(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID = T2.Template_ID WHERE T2.Template_Type_Code = 'PPT'\n", 'SELECT template_id, COUNT(*) FROM Documents GROUP BY template_id\n', 'SELECT T1.Template_Type_Code, T1.template_id FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id GROUP BY T1.template_id ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING COUNT(*) > 1\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\n', 'SELECT COUNT(*) FROM Templates\n', 'SELECT template_id, version_number, template_type_code FROM Templates\n', 'SELECT DISTINCT template_type_code FROM Templates\n', "SELECT template_id FROM Templates WHERE template_type_code = 'PP' OR template_type_code = 'PPT'\n", "SELECT COUNT(*) FROM Templates WHERE template_type_code = 'CV'\n", 'SELECT version_number, template_type_code FROM Templates WHERE version_number > 5\n', 'SELECT template_type_code, COUNT(*) FROM Templates GROUP BY template_type_code\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING COUNT(*) < 3\n', 'SELECT template_type_code, MIN(Version_Number) FROM Templates GROUP BY template_type_code\n', 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id = T2.template_id WHERE T2.document_name = "Data base